Load the csv into dataframe

In [ ]:
import pandas as pd 

file_path = '..\data\london_travel_network_data.csv'

df = pd.read_csv(file_path)

In [9]:
import sqlite3

# Create an in-memory SQLite database
conn = sqlite3.connect(':memory:')

# Write the pandas DataFrame to the SQLite database as a table
df.to_sql('journeys', conn, index=False, if_exists='replace')

936

In [11]:
query = "SELECT * FROM journeys"

# Execute SQL query
result_df = pd.read_sql(query, conn)

# Display results
display(result_df)

,index,month,year,days,report_date,journey_type,journeys_millions
0,0,2,2020,29,2020-06-30T00:00:00.000,Underground & DLR,8.041099
1,1,2,2020,29,2020-06-30T00:00:00.000,Bus,32.467243
2,2,2,2020,29,2020-06-30T00:00:00.000,Tram,0.470811
3,3,2,2020,29,2020-06-30T00:00:00.000,Overground,1.491890
4,4,2,2020,29,2020-06-30T00:00:00.000,Emirates Airline,0.004978
...,...,...,...,...,...,...,...
931,931,5,2012,31,2012-09-30T00:00:00.000,Bus,167.138336
932,932,5,2012,31,2012-09-30T00:00:00.000,Tram,2.328188
933,933,5,2012,31,2012-09-30T00:00:00.000,Overground,10.506406
934,934,5,2012,31,2012-09-30T00:00:00.000,Emirates Airline,0.534218
935,935,5,2012,31,2012-09-30T00:00:00.000,TfL Rail,NaN

Most Popular Transport Types

In [14]:
## most_popular_transport_types
popular_transport_types_query = """
SELECT 
	J.journey_type
	, SUM(J.journeys_millions)		AS total_journeys_millions
FROM journeys J
GROUP BY J.journey_type
ORDER BY total_journeys_millions DESC
"""

# Execute SQL query
popular_transport_types_df = pd.read_sql(popular_transport_types_query, conn)

display(popular_transport_types_df)

        journey_type  total_journeys_millions
0                Bus             24905.193947
1  Underground & DLR             15020.466544
2         Overground              1666.845666
3           TfL Rail               411.313421
4               Tram               314.689875
5   Emirates Airline                14.583718

Emirates Airline Popularity

In [16]:
## emirates_airline_popularity
emirates_airline_popularity_query = """
SELECT
	J.month
	, J.year
	, ROUND(J.journeys_millions, 2)		AS rounded_journeys_millions
FROM journeys J
WHERE J.journey_type = 'Emirates Airline'
ORDER BY J.journeys_millions DESC
LIMIT 5
"""

# Execute SQL query
emirates_airline_popularity_df = pd.read_sql(emirates_airline_popularity_query, conn)

display(emirates_airline_popularity_df)

   month  year  rounded_journeys_millions
0      5  2012                       0.53
1      6  2012                       0.38
2      4  2012                       0.24
3      5  2013                       0.19
4      5  2015                       0.19

Least Popular Years Tube

In [18]:
## least_popular_years_tube
least_popular_years_tube_query = """
SELECT
	J.year
	, J.journey_type
	, SUM(J.journeys_millions)		AS total_journeys_millions
FROM journeys J
WHERE J.journey_type = 'Underground & DLR'
GROUP BY J.journey_type, J.year
ORDER BY total_journeys_millions
LIMIT 5
"""

# Execute SQL query
least_popular_years_tube_df = pd.read_sql(least_popular_years_tube_query, conn)

display(least_popular_years_tube_df)

   year       journey_type  total_journeys_millions
0  2020  Underground & DLR               310.179316
1  2021  Underground & DLR               748.452544
2  2022  Underground & DLR              1064.859009
3  2010  Underground & DLR              1096.145588
4  2011  Underground & DLR              1156.647654